# Лабораторная работа 5

1. Изучить рассмотренный ниже пример. Запустить программу на двух процессорах. Поменять местами строки, помеченные в
   комментариях (1) и (2), и запустить программу еще раз. Просмотреть выходной файл и файл ошибок.
2. Разработать алгоритм решения задания, с учетом разделения вычислений между несколькими процессорами. Составить схему
   взаимодействия процессов.
3. Реализовать алгоритм с применением функций двухточечного обмена библиотеки MPI и протестировать его на нескольких
   примерах. Засечь время выполнения программы для различных наборов данных и различного количества процессоров.
   Вычислить ускорение и эффективность написанной программы.
4. Заменить все операции обменов в программе на обмены с упакованными данными, с последующей их распаковкой на стороне
   приема. Выяснить, улучшилась ли эффективность программы. Подумать почему, при необходимости изменить алгоритм или
   заменить тип обмена.

## Пример программы MPI

```c++
#include <mpi.h>
#include <stdio.h>
#define leng 20 //length of WR-string

int main(int argc, char **argv) {
  double t, t2;
  int i, rank, size;
  char WR[leng];
  MPI_Status status;
  MPI_Init(&argc, &argv);
  MPI_Comm_rank(MPI_COMM_WORLD, &rank);
  MPI_Comm_size(MPI_COMM_WORLD, &size);
  sprintf(WR, "Hello from %d", rank); // формирование сообщения
  t = MPI_Wtime(); // фиксация времени «начала посылки»,
  // локально для каждого процесса
  MPI_Send(WR, leng, MPI_CHAR, size - (rank + 1), rank, MPI_COMM_WORLD); // (1)
  MPI_Recv(WR, leng, MPI_CHAR, rank, size - (rank + 1), MPI_COMM_WORLD, &status); // (2)
  t2 = MPI_Wtime(); // фиксация времени «окончания приема»,
  // локально для каждого процесса

  printf("\n From processor %d\n WR=%s\n", rank, WR); // вывод сообщения
  printf("\n From processor %d\n Time=%le\n", rank, (t2 - t) / 100); // вывод времени,
  // затраченного на обмен данным процессором
  MPI_Finalize();
  return 0;
}
```

## Вариант 4

**Криптономикон.** В секретном институте № 127, находящемся где-то в Сибири, разработана новейшая система шифровки
данных для малого бизнеса. Система представляет собой ряд модулей, каждый из которых принимает на вход часть сообщения и
шифрует его по определенной схеме. Какую именно часть текста шифрует каждый из модулей, задается специальным ключом,
который меняется каждый день. Написать программу, моделирующую работу шифровальной системы. В качестве шифров
использовать прямые подстановки (вид шифра, когда каждому символу исходного текста ставится в соответствие какой-то
символ шифрованного текста, причем всегда один и тот же). В качестве ключа использовать подстановку, нижняя строка
которой задает номер модуля, текст делится на равные части, весь остаток получает тот модуль, который шифрует последнюю
часть. Использовать метод передачи информации «точка-точка».

## Вариант 5

**Криптономикон-2.** Дружественный секретный институт № 721, расположенный где-то на Урале разработал новейшую систему
дешифрования новейшей системы шифрования, разработанной в секретном институте № 127, находящемся где-то в Сибири. Решить
задачу, обратную задаче 4, написав программу-дешифровщик. Взяв в качестве входного сообщения шифрованный текст и ключ,
она должна восстанавливать исходный текст.

## Реализация

Для представленного задания разработана программа с помощью библиотеки MPI, в которой используется передача информации 
методом «точка-точка»:


